---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheet.IsBent
source: html/db25bd29-f58e-a58d-7acf-f0a2f9832832.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.IsBent Property

The type of fabric sheet. True for bent fabric sheet, false for flat fabric sheet.

## Syntax (C#)
```csharp
public bool IsBent { get; }
```